print('Задача 3. Животные')

# Что нужно сделать
# Создайте две переменные с именами «Первое животное» и «Второе животное» на английском языке. 
# Запишите в первую переменную слово «Заяц», а во вторую — «Черепаха». 
# Используя эти переменные, выведите на экран текст «Заяц спит, Черепаха идёт» в одну строку.

the_first_animal = 'Заяц'
the_second_animal = 'Черепаха'
print(f'{the_first_animal} спит, {the_second_animal} идёт')