def search_by_lastname(surname: str, base: dict) -> str:
    for i_name, i_age in base.items():
        if surname in i_name or surname + 'а' in i_name or surname[:-1] in i_name:
            print('{0} {1}'.format(i_name, i_age))


data_base = {'Иванов Никита': 33, 'Антонова Светлана': 29, 'Крюков Михаил': 45,
                    'Антонова Наталья': 41, 'Иванов Александр': 18, 'Крюков Антон': 24,
                    'Иванова Анна': 22, 'Антонов Игорь': 49, 'Крюкова Людмила': 26,
                    'Антонова Дарья': 19, 'Крюков Петр': 67, 'Антонов Павел': 55,
                    'Диментьев Владислав': 15, 'Мордашов Андрей': 47, 'Антонов Антон': 23,
                    'Крюков Анатолий': 21, 'Иванова Дарья': 25, 'Мордашова Зинаида': 39,
                    'Диментьева Алина': 44, 'Диментьев Руслан': 45, 'Крюкова Зоя': 56
}

last_name = input('Введите фамилию: ').title()
search_by_lastname(last_name, data_base)

